import React from "react";
import NavBar from "../../Navbar/NavBar";
import ControlledCarousel from "../../Carousel/ControlledCarousel";
import Footer from "../../Footer/Footer";
import './MainPage.css';

export default function MainPage() {
  return (
    <>
      <NavBar />
      <div className="main-content">
        <div className="carousel-block">
          <ControlledCarousel />
        </div>
        <div className="text-block">
          <h2>Бібліотека</h2>
          <p>
          Відвідування бібліотеки — це більше, ніж просто можливість отримати доступ до книг. Це простір, де відкриваються двері до нових знань, ідей та творчих можливостей. Тут можна знайти відповіді на питання, дослідити нові теми або зануритися у світ літературних шедеврів.
          </p>
          <p>
          Бібліотека — це також місце, де можна знайти тишу для зосередженої роботи або зустріти однодумців для обговорення цікавих тем. Вона допомагає розвивати критичне мислення та розширювати горизонти, а її ресурси стають цінною підтримкою як у навчанні, так і у повсякденному житті.

Відвідування бібліотеки вчить нас цінувати знання та використовувати їх для особистого зростання, розвитку та успіху. Тому варто пам'ятати: бібліотека — це ключ до світу можливостей, який завжди під рукою.
          </p>
        </div>
      </div>
      <Footer />
    </>
  );
}
